#include <avr/io.h>
#include <stdbool.h>
int main(void)
{
DDRC=0xFF; // θέτουμε τη θύρα C ως
έξοδο
DDRA=0x00; // θέτουμε τη θύρα Α ως
είσοδο
int f0,f1,f2,a,b,c,d,e,inp ;
while(1)
{
inp=PINA; // ανάγνωση εισόδου
a=inp&0b00000001 ; // PA0
b=inp&0b00000010 ; // PA1
c=inp&0b00000100 ; // PA2
d=inp&0b00001000 ; // PA3
e=inp&0b00010000 ; // PA4
b=b>>1 ; // μια μετατόπιση δεξιά
c=c>>2 ; // δύο μετατοπίσεις δεξία
d=d>>3 ; // τρεις μετατοπίσεις
δεξιά
e=e>>4 ; // τέσσερις μετατοπίσεις
δεξιά
f0= !((a&b&c) | (c&d) | (d&e)) ; // f0=(ABC + CD + DE)'
f1= (a&b&c) | (!(d|e)) ; // f1=(ABC +D'E')
f2= f0 | f1 ; // f2=(f0+f1)
f0=f0<<5 ; //πέντε μετατοπίσεις
αριστερά
f1=f1<<6 ; //έξι μετατοπίσεις
αριστερά
f2=f2<<7 ; //επτά μετατοπίσεις
αριστερά
PORTC= f0 | f1 | f2 ; //έξοδος
}
}